<div class="remodal video-modal" data-remodal-id="zhannas-video">
    <div class="modal-body">
        <iframe width="100%" height="600" src="https://www.youtube.com/embed/fqUGbai-dcY" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
    </div>
    <div class="modal-footer flex item-center">
{{--        <a href="#"><img src="{{ url('i/icons/play.svg') }}" alt=""></a>--}}
        <a href="#"  data-remodal-action="close"><img src="{{ url('i/icons/close-modal.svg') }}" alt=""></a>
    </div>
</div>

<div class="remodal repair-modal mb-0" data-remodal-id="contact-us">
    <button data-remodal-action="close" class="remodal-close"></button>

    <div class="modal-body flex tabos">
        @desktop
        <img data-type="feedback" src="{{ asset('i/contact-us-image.png') }}" alt="" class="cusimage">
        <img data-type="video" src="{{ asset('i/icons/video-consultation.png') }}" alt="" class="cusimage" style="display: none;">
        @enddesktop
        <div class="repair-block flex column space-between">
            @desktop
            <p class="title" data-type="feedback">{!! __('Обратная связь') !!}</p>
            <p class="title" data-type="video" style="display: none;">{!! __('Видео Консультация') !!}</p>
            @enddesktop
            @handheld
            <p class="title" data-type="feedback">{{ __('Обратная связь-1') }}</p>
            <p class="title" data-type="video" style="display: none;">{!! __('Видео Консультация-1') !!}</p>
            @endhandheld

            <div class="heighted flex column space-between">
                <div class="repair-forms">
                    <div class="repair-tab active" data-tab="clear">
                        <form action="{{ route('index.customer_request') }}" class="form styled" method="post" id="customer-request-form">
                            @csrf

                            <input type="hidden" name="type" value="{{ old('type', 'feedback') }}">

                            <div class="form-group">
                                <div class="dropdown lefted sorting theme-choose">
                                    <input type="hidden" name="theme_id" value="">
                                    <a href="#" class="element link flex">{{ __('Тема консультации') }} <img src="{{ url('i/icons/arrow-down-sort.svg') }}" alt=""></a>
                                    <div class="droppable">
                                        @foreach($customer_request_themes as $theme)
                                            <p><a href="#" data-value="{{ $theme->id }}">{{ $theme->name }}</a></p>
                                        @endforeach
                                    </div>
                                </div>
                                @error('theme_id', 'customer-request') <span class="error-msg">{{ $message }}</span> @enderror
                            </div>
                            <div class="form-group @error('name', 'customer-request') form-error @enderror">
                                <label for="">{{ __('Имя') }}</label>
                                @error('name', 'customer-request') <span class="error-msg">{{ $message }}</span> @enderror
                                <input type="text" name="name" placeholder="{{ __('Ваше имя') }}" required>
                            </div>
                            <div class="form-group @error('phone', 'customer-request') form-error @enderror">
                                <label for="">{{ __('Телефон') }}</label>
                                @error('phone', 'customer-request') <span class="error-msg">{{ $message }}</span> @enderror
                                <input type="text" name="phone" rel="phone" placeholder="+7 (---) --- -- --" required>
                            </div>
                            <div class="form-group custom-time-form @error('time_from', 'customer-request') form-error @enderror">
                                <label for="" class="cus-time">{{ __('Удобное время звонка') }}</label>
                                @error('time_from', 'customer-request') <span class="error-msg">{{ $message }}</span> @enderror
                                <div class="double flex space-between item-center">
                                    <input type="text" name="time_from" placeholder="с 00:00" rel="time" required>
                                    <input type="text" name="time_to" placeholder="до 00:00" rel="time" required>
                                </div>
                            </div>
                            <div class="form-group">
                                <button type="submit" class="btn-black">{{ __('Заказать консультацию') }}</button>
                            </div>
                        </form>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<div class="remodal repair-modal" data-remodal-id="clean-and-repair">
    <button data-remodal-action="close" class="remodal-close"></button>

    <div class="modal-body flex tabos">
        <img src="{{ url('i/repair.jpg') }}" alt="" style="max-width: 50%;">
        <div class="repair-block flex column space-between">
            <p class="title">{{ __('Профессиональные услуги ювелира') }}</p>

            <div class="heighted flex column space-between">
                <div class="repair-headers flex item-center">
                    <a href="#" class="flex item-center space-center active" data-link-tab="clear">
                        <svg width="13" height="14" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M3.73204 9.1875H12.4532C12.7552 9.1875 13.0001 8.94266 13.0001 8.64062V7.49079C13.0017 6.70277 12.4432 6.02372 11.6722 5.87612L9.93319 5.54323C9.49451 5.45926 9.20749 5.04998 9.2771 4.60972C9.32684 4.35447 9.7563 2.27478 9.74613 1.88595C9.74381 1.38195 9.54062 0.90784 9.17336 0.549965C8.80939 0.195344 8.33085 2.73438e-05 7.82583 0C7.3191 0 6.8448 0.198105 6.49037 0.557785C6.14007 0.913281 5.94664 1.38614 5.94538 1.88975C5.93955 2.28599 6.37205 4.60898 6.37205 4.60898C6.44186 5.04938 6.15464 5.45896 5.71599 5.54291L3.97168 5.87664C3.19998 6.02427 2.63966 6.70168 2.63933 7.48691C2.63933 7.48691 2.63807 9.69776 2.63807 10.3906C2.63807 11.9384 1.20898 12.9999 1.19591 13.0095C1.00341 13.1482 0.922331 13.3953 0.995229 13.6211C1.06818 13.847 1.27837 14 1.51569 14H4.49616C4.63446 14 4.7676 13.9476 4.86883 13.8534C5.20855 13.5371 5.51797 13.1658 5.78569 12.7589C5.75307 12.933 5.70519 13.0885 5.64378 13.2165C5.56243 13.3859 5.5738 13.5853 5.67394 13.7444C5.77407 13.9035 5.94882 14 6.13678 14H11.6055C11.7149 14 11.8217 13.9672 11.9122 13.9059C12.0236 13.8305 13.0001 13.1133 13.0001 11.1836C13.0001 10.8816 12.7552 10.6367 12.4532 10.6367C12.1512 10.6367 11.9063 10.8816 11.9063 11.1836C11.9063 12.1966 11.5702 12.7076 11.3935 12.9062H9.06866C9.09316 12.6951 9.11378 12.4363 9.1172 12.1471C9.11977 11.9276 9.10361 11.6964 9.08827 11.497C9.06508 11.1958 8.80182 10.9707 8.50103 10.9937C8.19987 11.0169 7.97456 11.2798 7.99772 11.5809C8.01128 11.757 8.02555 11.9594 8.02348 12.1342C8.01981 12.444 7.99282 12.7124 7.96611 12.9062H6.87044C6.90725 12.6927 6.92726 12.4653 6.92967 12.2282C6.93558 11.6459 6.83123 11.0321 6.63592 10.4998C6.55364 10.2755 6.33538 10.1313 6.09656 10.142C5.85788 10.1533 5.65422 10.3183 5.59355 10.5494C5.36525 11.419 4.8781 12.2848 4.27325 12.9062H2.82001C3.28191 12.3015 3.73179 11.4426 3.73179 10.3906C3.73185 9.94079 3.73193 9.53862 3.73204 9.1875ZM3.7331 7.48778C3.73321 7.22591 3.92 7.00011 4.17719 6.95089L5.92151 6.61716C6.41471 6.5228 6.84452 6.24403 7.13177 5.83218C7.41901 5.42032 7.53216 4.92067 7.45029 4.42526C7.44964 4.42113 7.44887 4.417 7.44811 4.41287C7.44811 4.41287 7.03292 2.21558 7.03902 1.90548C7.0391 1.90189 7.03913 1.89831 7.03913 1.8947C7.03913 1.44558 7.3847 1.09375 7.82583 1.09375C8.27389 1.09375 8.65241 1.46054 8.65241 1.8947C8.65241 1.9008 8.20003 4.41897 8.19921 4.42394C8.11688 4.91955 8.22973 5.41953 8.51695 5.83177C8.80414 6.244 9.23409 6.52302 9.72751 6.61749L11.4665 6.95037C11.7219 6.99926 11.9069 7.22559 11.9063 7.48967V8.09375H3.73256C3.73286 7.6968 3.7331 7.48778 3.7331 7.48778Z" fill="white"/>
                        </svg>
                        {{ __('Чистка') }}
                    </a>
                    <a href="#" class="flex item-center space-center" data-link-tab="repair">
                        <svg width="13" height="14" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M10.7595 0.691557C10.5042 0.437006 10.2031 0.223022 9.8647 0.0555918C9.69933 -0.0262122 9.50344 -0.0168052 9.34672 0.0805259C9.18999 0.17783 9.09466 0.349215 9.09466 0.533722V2.85136L8.30211 3.34528L7.52098 2.85302V0.533428C7.52098 0.349082 7.42579 0.177803 7.26923 0.0804457C7.11268 -0.0168853 6.91698 -0.0265329 6.75163 0.0549772C6.39114 0.232669 6.08389 0.44684 5.83837 0.691557C5.1935 1.33436 4.75148 2.17982 4.62566 3.0112C4.47413 4.01214 4.7646 4.93609 5.44357 5.61287C5.71899 5.88736 6.20658 6.18301 6.69415 6.33441V12.0559C6.69412 12.483 6.85829 12.8842 7.15643 13.1856C7.45676 13.4892 7.85838 13.6564 8.28712 13.6564H8.28741C8.71533 13.6564 9.1178 13.4901 9.42064 13.1883C9.72653 12.8834 9.8949 12.4813 9.89482 12.0559C9.89477 11.7614 9.65593 11.5226 9.36137 11.5226C9.06676 11.5227 8.82787 11.7616 8.82792 12.0562C8.82795 12.1958 8.77094 12.3295 8.66749 12.4326C8.56599 12.5338 8.43103 12.5895 8.28725 12.5895C8.14556 12.5895 8.01325 12.5348 7.91487 12.4353C7.81564 12.335 7.76102 12.2003 7.76102 12.056V5.90064C7.76102 5.6203 7.54399 5.38779 7.26429 5.36847C6.93421 5.34568 6.41036 5.07012 6.19672 4.85718C5.76448 4.4263 5.58112 3.8274 5.68053 3.17083C5.76394 2.61977 6.04265 2.05422 6.45405 1.59258V3.14728C6.45405 3.33051 6.54807 3.5009 6.70307 3.59858L8.01608 4.42605C8.18904 4.53509 8.40912 4.53563 8.58267 4.4275L9.91024 3.6001C10.0666 3.50267 10.1616 3.33155 10.1616 3.14736V1.61281C10.6491 2.17018 10.935 2.87191 10.935 3.52883C10.935 3.89204 10.8424 4.41737 10.4012 4.85715C10.181 5.07659 9.65676 5.35396 9.33601 5.36922C9.05158 5.38277 8.82792 5.61733 8.82792 5.90208V12.0795C8.82792 12.3741 9.06676 12.613 9.36137 12.613C9.65596 12.613 9.89482 12.3741 9.89482 12.0795V6.34034C10.3817 6.19167 10.8724 5.8939 11.1544 5.61281C11.7088 5.06015 12.0019 4.33955 12.0019 3.52888C12.0019 2.52765 11.5375 1.467 10.7595 0.691557Z" fill="#272727"/>
                            <path d="M3.26069 3.32375C3.39073 3.19178 3.44295 3.00177 3.39864 2.82186L2.81185 0.439096C2.75313 0.200713 2.53936 0.0332031 2.29387 0.0332031H1.12026C0.874765 0.0332031 0.660995 0.20074 0.602281 0.439096L0.0154884 2.82186C-0.028821 3.00177 0.0233989 3.19178 0.153441 3.32375L1.20027 4.38645V6.95276C0.579298 7.17295 0.133371 7.76626 0.133371 8.46169V12.0825C0.133264 12.51 0.299732 12.9119 0.602094 13.2143C0.90435 13.5165 1.3061 13.683 1.73332 13.683C1.73345 13.6829 1.73364 13.683 1.73377 13.683C2.16129 13.683 2.56315 13.5165 2.8654 13.2143C3.16768 12.912 3.33415 12.51 3.3341 12.0826V8.46171C3.3341 8.0342 3.1676 7.63234 2.86532 7.33006C2.69359 7.15833 2.48965 7.03042 2.2672 6.95201V4.33231L3.26069 3.32375ZM2.26717 8.46171V12.0826C2.2672 12.2252 2.21172 12.3591 2.11097 12.4598C2.01024 12.5606 1.8763 12.6161 1.73364 12.6161H1.73348C1.59109 12.6161 1.4572 12.5606 1.3565 12.4598C1.25575 12.3591 1.20027 12.2252 1.2003 12.0827V8.46171C1.2003 8.16761 1.43959 7.92829 1.73372 7.92826C1.87622 7.92826 2.01019 7.98374 2.11094 8.0845C2.21169 8.1853 2.2672 8.31925 2.2672 8.46171H2.26717ZM1.70708 3.38059L1.12277 2.78741L1.53831 1.10005H1.87584L2.29141 2.78741L1.70708 3.38059Z" fill="#272727"/>
                        </svg>
                        {{ __('Ремонт') }}
                    </a>
                </div>
                <div class="repair-forms">
                    <div class="repair-tab active" data-tab="clear">
                        <form action="{{ route('return.action') }}" class="form styled" method="post">
                            @csrf
                            <input type="hidden" name="type" value="clear">
                            <div class="form-group @error('rep_name') form-error @enderror">
                                <label for="">{{ __('Имя') }}</label>
                                @error('rep_name') <span class="error-msg">{{ $message }}</span> @enderror
                                <input type="text" name="rep_name" placeholder="{{ __('Ваше имя') }}" required>
                            </div>
                            <div class="form-group @error('rep_phone') form-error @enderror">
                                <label for="">{{ __('Телефон') }}</label>
                                @error('rep_phone') <span class="error-msg">{{ $message }}</span> @enderror
                                <input type="text" name="rep_phone"  placeholder="{{ __('Введите номер') }}" required>
                            </div>
                            <div class="form-group @error('rep_time_from') form-error @enderror">
                                <label for="">{{ __('Удобное время звонка') }}</label>
                                @error('rep_time_from') <span class="error-msg">{{ $message }}</span> @enderror
                                <div class="double flex space-between item-center">
                                    <input type="text" name="rep_time_from" placeholder="с 00:00" rel="time" required>
                                    <input type="text" name="rep_time_to" placeholder="до 00:00" rel="time" required>
                                </div>
                            </div>
                            <div class="form-group">
                                <button type="submit" class="btn-black">{{ __('Заказать консультацию') }}</button>
                            </div>
                        </form>
                    </div>
                    <div class="repair-tab" data-tab="repair">
                        <form action="{{ route('return.action') }}" class="form styled" method="post">
                            @csrf
                            <input type="hidden" name="type" value="repair">
                            <div class="form-group @error('rep_name') form-error @enderror">
                                <label for="">{{ __('Имя') }}</label>
                                @error('rep_name') <span class="error-msg">{{ $message }}</span> @enderror
                                <input type="text" name="rep_name" placeholder="{{ __('Ваше имя') }}">
                            </div>
                            <div class="form-group @error('rep_phone') form-error @enderror">
                                <label for="">{{ __('Телефон') }}</label>
                                @error('rep_phone') <span class="error-msg">{{ $message }}</span> @enderror
                                <input type="text" name="rep_phone" placeholder="{{ __('Введите номер') }}">
                            </div>
                            <div class="form-group @error('rep_time_from') form-error @enderror">
{{--                                <label for="">{{ __('Удобное время звонка') }}</label>--}}
{{--                                @error('rep_time_from') <span class="error-msg">{{ $message }}</span> @enderror--}}
                                <div class="double flex space-between item-center">
                                    <input type="text" name="rep_time_from" placeholder="с 00:00" rel="time" required>
                                    <input type="text" name="rep_time_to" placeholder="до 00:00" rel="time" required>
                                </div>
                            </div>
                            <div class="form-group">
                                <button type="submit" data-type="application-success" class="btn-black customer-request">{{ __('Заказать консультацию') }}</button>
                            </div>
                        </form>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

@if(Session::has('message'))
<div class="remodal" data-remodal-id="notify">
    <button data-remodal-action="close" class="remodal-close"></button>
    <div class="modal-body">
        <div class="success-item">
            @desktop
            <img src="{{ asset('i/icons/video-consultation.png') }}" class="img" alt="">
            @enddesktop
            <div class="success-info">
                <svg width="19" height="17" viewBox="0 0 19 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M1 11.9091L5.4443 15.3849C5.87885 15.7248 6.50655 15.6485 6.84709 15.2145L18 1" stroke="#27AE60" stroke-width="1.3" stroke-linecap="round"/>
                </svg>
                <p class="title">{!! __('Заявка оформлена!') !!}</p>
                <p class="text">{{ __('Мы свяжемся с вами в ближайшее время') }}</p>
            </div>
        </div>
    </div>
</div>
@endif

<div class="remodal payment-success" data-remodal-id="payment-success">
    <button data-remodal-action="close" class="remodal-close"></button>
    <div class="modal-body">
        <div class="success-item">
            <img src="{{ asset('i/video-zhanna.jpg') }}" class="img" alt="">
            <div class="success-info">
                <svg width="207" height="61" viewBox="0 0 207 61" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M135.316 31.7752L137.594 28.5217H135.533V28.0879H138.245V28.4132L136.076 31.6667H138.353V32.1005H135.425V31.7752H135.316Z" fill="#272727"/>
                    <path d="M143.671 28.0879V29.7146H145.623V28.0879H146.166V32.1005H145.623V30.2569H143.671V32.1005H143.129V28.0879H143.671Z" fill="#272727"/>
                    <path d="M152.449 30.7991L152.015 32.1005H151.473L152.882 28.0879H153.533L154.943 32.1005H154.401L153.967 30.7991H152.449ZM153.859 30.3654L153.425 29.1724C153.316 28.9555 153.316 28.6301 153.208 28.4132C153.099 28.6301 153.099 28.847 152.991 29.1724L152.557 30.3654H153.859Z" fill="#272727"/>
                    <path d="M159.828 32.1005V28.0879H160.37L161.672 30.1485C161.997 30.5823 162.214 31.0161 162.431 31.4499C162.431 30.9076 162.322 30.4738 162.322 29.8231V28.1964H162.865V32.209H162.322L161.021 30.1485C160.696 29.7147 160.479 29.2809 160.262 28.8471C160.262 29.3893 160.262 29.8231 160.262 30.4738V32.209H159.828V32.1005Z" fill="#272727"/>
                    <path d="M168.504 32.1005V28.0879H169.046L170.348 30.1485C170.673 30.5823 170.89 31.0161 171.107 31.4499C171.107 30.9076 170.998 30.4738 170.998 29.8231V28.1964H171.541V32.209H170.998L169.697 30.1485C169.371 29.7147 169.155 29.2809 168.938 28.8471C168.938 29.3893 168.938 29.8231 168.938 30.4738V32.209H168.504V32.1005Z" fill="#272727"/>
                    <path d="M177.933 30.7991L177.499 32.1005H176.957L178.367 28.0879H179.018L180.427 32.1005H179.885L179.451 30.7991H177.933ZM179.234 30.3654L178.801 29.1724C178.692 28.9555 178.692 28.6301 178.584 28.4132C178.475 28.6301 178.475 28.847 178.367 29.1724L177.933 30.3654H179.234Z" fill="#272727"/>
                    <path d="M186.827 28.0879H187.369V30.04C187.478 29.9315 187.586 29.7147 187.695 29.6062L188.888 28.0879H189.538L188.129 29.8231L189.647 32.1005H188.996L187.695 30.1485L187.261 30.5822V32.1005H186.719V28.0879H186.827Z" fill="#272727"/>
                    <path d="M195.617 30.7991L195.183 32.1005H194.641L196.05 28.0879H196.701L198.111 32.1005H197.569L197.135 30.7991H195.617ZM196.918 30.3654L196.484 29.1724C196.376 28.9555 196.376 28.6301 196.267 28.4132C196.159 28.6301 196.159 28.847 196.05 29.1724L195.617 30.3654H196.918Z" fill="#272727"/>
                    <path d="M202.984 32.1005V28.0879H203.527L204.828 30.1485C205.153 30.5823 205.37 31.0161 205.587 31.4499C205.587 30.9076 205.479 30.4738 205.479 29.8231V28.1964H206.021V32.209H205.479L204.177 30.1485C203.852 29.7147 203.635 29.2809 203.418 28.8471C203.418 29.3893 203.418 29.8231 203.418 30.4738V32.209H202.984V32.1005Z" fill="#272727"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M98.5511 6.72383C98.1173 7.91678 97.7919 9.43512 97.3581 10.6281C96.2736 14.2069 94.43 17.8942 92.3694 20.9308C90.5258 23.642 87.4892 27.004 84.8864 28.7392C83.8019 29.3899 82.0667 30.5828 81.6329 29.4983C81.1991 28.5222 83.4766 14.7491 83.9104 12.0379C84.0188 11.1703 84.2357 10.0858 84.4526 9.32665C84.778 8.24216 85.1033 7.91678 84.6695 6.72383L84.2357 6.83232C83.1512 9.54357 81.6329 19.5209 81.1991 23.2082C80.9822 25.0519 80.8738 27.2208 80.5484 28.956C79.5724 28.7391 78.3794 28.0885 77.2949 27.7631C74.4752 26.8955 74.2583 28.9561 75.1259 29.9321C77.1865 32.2096 79.0301 31.6673 80.1146 32.318C80.2231 33.2941 79.8977 35.4631 79.7893 36.656C79.5724 38.7166 79.0301 45.6573 80.1146 47.2841C80.3315 47.6094 80.9822 48.0432 81.416 47.9347C81.416 47.9347 81.8498 47.9348 81.3076 47.2841C81.3076 47.2841 80.9822 46.9587 80.8738 46.8503C80.6569 46.5249 80.5484 46.1996 80.44 45.6573C79.8977 42.5123 80.6569 37.0898 80.8738 33.6194C80.9822 32.5349 80.9822 31.5589 82.1752 31.7758C83.4766 31.9927 94.9722 40.4518 99.0933 40.6687C101.371 40.7771 102.455 38.9334 102.13 37.8489C102.021 37.5236 102.13 37.7405 101.913 37.5236C100.72 36.7645 101.696 40.6686 97.2497 38.9334C95.2976 38.1743 84.4526 32.1011 83.8019 31.0166C84.0188 30.5828 86.1878 29.3898 87.2723 28.4138C92.8032 23.2082 96.1652 17.5688 98.4426 9.8689C98.9849 7.91681 100.829 1.84365 100.178 0C98.9849 0 99.0933 2.06051 98.8764 3.145C98.9849 4.2295 98.6595 5.53089 98.5511 6.72383ZM75.9935 28.956C77.1865 28.7391 80.0062 29.8237 80.3315 30.6913C79.6808 31.0166 78.271 30.9081 77.5118 30.5828C76.8611 30.2574 75.8851 29.7152 75.9935 28.956Z" fill="#272727"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M25.5679 6.28988C25.351 7.04903 24.5919 8.02504 24.2665 8.89264C23.9412 9.76023 23.6158 10.7363 23.3989 11.7124C22.7482 14.6405 20.9046 31.7756 20.9046 31.7756C21.3384 34.8122 19.3863 45.2233 20.9046 46.5247C21.7722 45.874 21.8806 44.2473 22.206 43.0543C22.6398 41.1022 25.0257 32.9685 26.3271 32.7516C26.7609 33.2938 26.9778 35.6798 27.0862 36.6558C27.3031 37.9572 27.7369 39.0417 28.1707 40.1262C30.3397 44.898 33.2678 42.4036 32.8341 41.3191C31.858 41.1022 31.3158 42.9459 30.0144 41.5361C29.3637 40.8854 29.0383 39.8009 28.713 38.8248C28.1707 37.1981 27.7369 33.2939 27.1947 32.3178C25.2426 28.739 22.0975 40.1262 21.6637 41.8614C21.4468 41.6445 21.5553 41.8614 21.4468 41.5361C21.3384 41.1023 21.6637 37.1981 21.6637 36.6558L22.4229 26.4615C22.6398 24.1841 26.544 14.0982 27.0862 9.43489C27.3031 7.59124 27.52 5.42228 25.5679 6.28988ZM23.182 20.1714C22.7482 19.3038 24.4834 8.56731 26.2186 7.15747C26.9778 8.35041 25.5679 12.4715 25.1341 13.8814L23.5074 19.5208C23.5074 19.6292 23.3989 19.8461 23.2905 19.8461C23.2905 20.1715 23.2905 20.063 23.182 20.1714Z" fill="#272727"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M116.013 33.836C116.772 32.86 117.314 32.1009 119.917 33.7276C120.459 34.053 121.544 33.7276 122.845 33.0769C124.797 32.2093 127.508 31.1248 131.087 31.4502C131.304 31.4502 131.412 31.6671 131.412 31.8839C131.412 32.1008 131.196 32.2093 130.979 32.2093C127.617 31.8839 125.014 32.9685 123.062 33.7276C121.435 34.3783 120.351 34.9206 119.375 34.2699C117.422 32.9685 116.989 33.5107 116.555 34.1614C116.338 34.4868 116.013 34.8121 115.579 35.1374C115.037 35.7881 113.844 35.8966 112.976 34.1614C112.434 33.1854 112 29.9319 111.349 29.3896C110.373 30.1488 108.746 35.3544 108.096 36.9811C107.662 38.174 107.445 38.9332 106.252 38.7163C104.842 36.5473 106.144 31.0164 106.035 29.0643C105.168 29.6065 105.601 30.691 103.758 32.86C103.432 33.2938 102.673 34.2699 101.806 33.4023C101.155 32.7516 101.48 31.6671 100.938 31.0164C100.287 31.6671 99.2029 34.8121 97.793 33.836C96.7085 33.0769 97.793 28.4135 99.7451 26.7868C100.504 26.1361 101.48 26.57 101.914 27.1122C102.673 28.0882 101.372 31.5586 102.565 32.7515C104.083 32.5346 106.361 26.0276 107.011 24.0756C107.228 23.5333 107.337 22.9911 107.553 22.4488C107.77 21.7981 107.77 21.1475 108.421 21.1475C109.072 21.7982 108.313 23.9672 108.096 24.9432C107.553 27.4375 105.71 35.5712 106.903 37.3064C107.987 36.2219 109.939 26.7868 112.217 28.3051C112.759 28.6305 112.976 29.6065 113.084 30.3657C113.301 31.6671 113.518 34.2698 114.711 34.5952C115.253 34.8121 115.687 34.2698 116.013 33.836ZM98.3353 33.2938C98.0099 32.3177 99.3113 27.546 101.046 27.546C101.372 28.522 99.962 31.2333 99.4198 32.3178C99.0944 32.7516 98.986 33.1853 98.3353 33.2938Z" fill="#272727"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M54.4121 31.6678C54.9543 32.2101 55.4966 38.3917 58.3163 39.2593C59.6177 39.6931 60.3768 38.6087 61.136 38.2833C61.136 38.934 61.136 39.8016 61.4613 40.127C62.0036 40.6692 62.7627 40.2354 63.0881 39.8016C64.281 38.6086 64.3895 37.4157 65.1486 36.9819C65.5824 37.6326 65.7993 38.1748 66.7754 38.3917C67.7514 38.6086 68.619 38.1749 69.2697 37.7411C70.6796 36.765 71.2218 36.0058 71.7641 33.8368C70.788 34.2706 70.6796 35.6805 69.1613 36.8735C67.9683 37.7411 66.45 38.3918 65.9078 36.3312C65.7993 35.789 65.6909 34.2706 65.9078 33.8368C66.2331 33.2946 67.4261 33.6199 66.6669 32.2101C64.8233 29.065 61.6782 36.1143 61.4613 36.4396C56.6895 42.8382 55.9304 31.0171 54.7374 30.5833C53.653 30.3664 53.5445 31.3425 53.2192 32.2101C52.8938 33.0777 52.5684 33.8368 52.2431 34.8129C51.8093 36.1143 51.1586 38.934 50.5079 39.91C50.0741 39.2593 49.9657 33.7284 49.9657 32.5355C49.9657 31.2341 49.9657 29.9326 49.9657 28.6312C49.9657 27.8721 50.3995 25.4862 50.291 25.0524C49.2065 24.6186 49.315 26.1369 49.0981 27.8721C48.7727 31.1256 48.9896 37.0904 49.4234 40.127C49.5319 40.6692 49.5319 41.4283 49.8572 41.6452C50.3995 42.079 50.8333 41.5368 51.0502 41.103C51.484 40.3438 51.8093 38.8255 52.1347 37.8495C52.7854 36.2227 53.5445 32.8608 54.4121 31.6678ZM62.112 39.3678C61.6782 37.5242 64.1726 31.9932 66.0162 32.427C66.0162 33.403 65.3655 32.8608 65.0402 34.1622C64.6064 35.6805 63.5219 39.1509 62.112 39.3678Z" fill="#272727"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M41.3994 32.8595C40.9656 34.5947 38.905 39.475 37.7121 39.6918C36.9529 38.9327 37.1698 36.9806 37.2783 35.7877C37.3867 34.2694 37.0614 33.2933 35.4346 33.4018C33.4825 34.8116 32.8318 36.5468 32.6149 39.0412C32.5065 39.6919 32.5065 40.5594 32.9403 40.8848C34.2417 41.8608 35.2177 38.9327 36.0853 38.0651C36.6276 38.7158 36.3022 39.8003 36.9529 40.451C38.1459 41.644 39.8811 38.7158 40.2064 38.0651C40.5318 37.4144 40.7487 36.4384 41.2909 36.113C41.3994 37.9567 40.2064 43.7045 41.5078 45.765C42.8092 45.9819 42.9177 45.2228 43.3515 44.0298C44.0022 42.4031 45.7374 37.0891 46.605 36.4384C47.2557 36.8722 47.6895 40.1256 48.1233 41.1017C49.5331 44.0298 51.7021 41.644 50.9429 40.9933C50.2923 40.5595 50.4007 41.5355 49.75 41.8608C48.0148 41.9693 48.6655 32.1004 45.5205 36.3299C44.436 37.8482 42.5923 44.0298 41.9416 44.5721C40.7487 42.9453 42.5923 34.7031 43.1346 32.2088C43.3515 31.2327 44.1106 28.9553 43.4599 28.413C42.4839 28.1961 42.267 31.6666 41.3994 32.8595ZM33.591 39.8003C33.2656 38.8242 34.567 34.0524 36.3022 34.0524C36.5191 34.8116 35.76 36.5468 35.4346 37.3059C35.2177 37.8482 35.0008 38.282 34.6755 38.7158C34.3501 39.3665 34.2417 39.8003 33.591 39.8003Z" fill="#272727"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M33.0493 11.2781C26.8677 12.3626 13.5284 17.2428 9.62416 18.3273C9.73261 17.8935 9.94951 17.5682 9.40726 17.3513C8.97346 17.2428 8.75657 17.4597 8.53967 17.6766C7.78052 18.5442 7.45517 22.1231 12.3354 18.978C16.3481 16.3752 31.531 11.495 34.3507 11.9288C34.6761 11.495 34.4592 11.6034 35.3268 11.6034C35.2183 12.1456 35.3268 12.0372 34.893 12.3626C34.6761 13.3386 33.2662 14.8569 32.724 15.5076C26.9761 22.2315 21.5536 28.4132 15.9143 35.2455C12.7692 39.0412 9.84107 42.9454 6.80447 47.0665C6.15377 47.9341 -3.06446 58.8875 1.05663 59.972C2.24958 60.2974 2.57493 60.1889 3.65943 60.0805C5.28617 60.5143 48.9914 43.5961 52.3534 46.7412C53.5463 47.0665 53.9801 48.8017 54.6308 48.151C55.1731 47.5003 53.5463 45.8735 52.8956 45.7651C45.3041 42.7285 14.7213 55.6341 7.12982 58.02C6.69602 58.1284 6.58757 58.2368 6.15377 58.2368C4.63547 58.4537 2.57493 59.4298 1.27353 58.6706C1.05663 57.2608 1.92423 56.0678 2.57493 54.8749C5.61152 49.5608 14.1791 38.8243 17.8664 34.3779C19.3846 32.4258 20.9029 30.6906 22.5297 28.8469C24.9156 26.0272 35.3268 14.4231 36.1944 12.1456C36.3028 10.7358 35.9775 10.6274 34.5676 10.8443H34.1338C33.9169 11.1697 34.3507 10.9527 33.5916 11.1696C33.3747 11.1696 33.1578 11.1696 33.0493 11.2781Z" fill="#272727"/>
                </svg>
                <p class="title">{!! __('Благодарим за заказ!') !!}</p>
                <p class="text">{{ __('Вы можете отследить статус') }}</p>
                <a href="#" class="btn-black">{{ __('Отслеживать заказ') }}</a>
{{--                <a href="{{ __('user.profile.orders.show') }}" class="btn-black">{{ __('Отслеживать заказ') }}</a>--}}
            </div>
        </div>
    </div>
</div>

<div class="remodal product-mini-modal" data-remodal-id="mobile-login">
    <button data-remodal-action="close" class="remodal-close"></button>
    <div class="droppable login mobile-login @if($errors->login->any() || $errors->register->any()) active @endif">
        <a class="close-dropdown"><img src="{{ url('i/icons/close-black.svg') }}" alt=""></a>
        <div class="login-register">
            <div class="flex divider">
                <a href="#" class="@if($errors->login->any()) active @endif @if(!$errors->register->any()) active @endif " data-link-tab="login"><span>{{ __('Вход') }}</span></a>
                <a href="#" @if($errors->register->any()) class="active" @endif data-link-tab="register"><span>{{ __('Регистрация') }}</span></a>
            </div>
            <div class="divider-content">
                {{--login--}}
                <div data-tab="login" class="@if($errors->login->any()) active @endif @if(!$errors->register->any()) active @endif">
                    <form action="{{ route('auth.login') }}" class="form" method="post">
                        @csrf
                        <div class="form-group input-top @error('log_email', 'login') form-error @enderror">
                            @error('log_email', 'login') <span class="error-msg">{{ $message }}</span> @enderror
                            <input type="email" name="log_email" placeholder="Введите Email">
                        </div>
                        <div class="form-group input-top @error('log_password', 'login') form-error @enderror">
                            @error('log_password', 'login') <span class="error-msg">{{ $message }}</span> @enderror
                            <input type="password" class="password" name="log_password" placeholder="{{ __('Введите пароль') }}">
                            <a href="#" class="forgot-password">{{ __('Забыли пароль?') }}</a>
                        </div>
                        <div class="form-group">
                            <button type="submit">{{ __('Войти') }}</button>
                        </div>
                    </form>
                    <a href="#" data-link-tab="register" class="no-account"><img src="{{ url('i/icons/reg-plus.svg') }}" alt=""> {{ __('У меня нет аккаунта') }}</a>
                </div>
                {{--register--}}
                <div data-tab="register" @if($errors->register->any()) class="active" @endif>
                    <form action="{{ route('auth.register') }}" class="form register" method="post">
                        @csrf
                        <div class="form-group @error('reg_name', 'register') form-error @enderror">
                            @error('reg_name', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                            <input type="text" name="reg_name" placeholder="{{ __('Ваше имя') }}" value="{{ old('reg_name') }}">
                        </div>
                        <div class="form-group @error('reg_email', 'register') form-error @enderror">
                            @error('reg_email', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                            <input type="email" name="reg_email" placeholder="Email" value="{{ old('email') }}">
                        </div>
                        <div class="form-group @error('reg_password', 'register') form-error @enderror">
                            @error('reg_password', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                            <input type="password" class="password" name="reg_password" placeholder="{{ __('Пароль') }}">
                        </div>
                        <div class="form-group selects">
                            <input type="hidden" name="reg_sex" value="female">
                            <a href="#" class="active" data-sex="female">{{ __('Женщина') }}</a>
                            <a href="#" data-sex="male">{{ __('Мужчина') }}</a>
                        </div>
                        <div class="form-group checkbox @error('rules_accept', 'register') form-error @enderror">
                            <label for="rules-accept" class="remember wider">
                                <p><a href="#"></a>{!! __('Условия пользования') !!}</a></p>
                                <input type="checkbox" id="rules-accept" name="rules_accept"><p class="checkmark"></p>
                            </label>
                            @error('rules_accept', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                        </div>
                        <div class="form-group">
                            <button type="submit">{{ __('Стать участником') }}</button>
                        </div>
                    </form>
                    <div class="welcome">
                        <p>{{ __('Добро пожаловать в клуб!') }}</p>
                        <img src="{{ url('i/icons/zhanna-v2.svg') }}" alt="">
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<div class="remodal" data-remodal-id="online-boutique">
    <button data-remodal-action="close" class="remodal-close"></button>
    <div class="modal-body">
        <div class="online-butik">
            <p class="text-fonted">{{ __('Онлайн бутик') }}</p>
            <div class="online-functions flex">
                <a href="#" data-type="feedback" class="customer-request">{{ __('Личный звонок-1') }}</a>
                <a href="#" data-type="feedback" class="customer-request">{{ __('Напишите нам-1') }}</a>
                <a href="{{ route('about.contacts') }}" class="adresses flex item-center"><img src="{{ url('i/icons/location.svg') }}" alt=""> {{ __('Адреса бутиков') }}</a>
            </div>
            <a href="#" class="video-consultation flex column">
                <span class="flex items-start space-between customer-request" data-type="video">{!! __('Видео Консультация') !!} <img src="{{ url('i/icons/video.svg') }}" alt=""></span>
                <span>{{ __('Мы всегда на связи') }}</span>
            </a>
        </div>
    </div>
</div>

<div class="remodal" data-remodal-id="help">
    <button data-remodal-action="close" class="remodal-close"></button>
    <div class="modal-body">
        <div class="need-help">
            <p class="text-fonted">{{ __('Нужна помощь?') }}</p>
            <div class="links">
                <a href="{{ route('page.info.return') }}">
                    <svg width="11" height="12" viewBox="0 0 11 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M6.90791 3.33223H2.22859L4.23401 1.20858C4.49523 0.931957 4.49523 0.483267 4.23401 0.206648C3.97279 -0.0688826 3.55011 -0.0688826 3.28889 0.206648L0.196429 3.48252C0.0709611 3.61538 0 3.79508 0 3.98348C0 4.1708 0.0709611 4.35049 0.196429 4.48336L3.39585 7.8714C3.52646 8.00971 3.69718 8.07941 3.86892 8.07941C4.03964 8.07941 4.21036 8.00971 4.34097 7.8714C4.60219 7.59587 4.60219 7.14718 4.34097 6.87056L2.33657 4.748H6.90791C8.42792 4.748 9.66408 6.05704 9.66408 7.66557C9.66408 9.27628 8.42792 10.5853 6.90791 10.5853H5.32414C4.95494 10.5853 4.65567 10.9022 4.65567 11.2921C4.65567 11.6831 4.95494 12 5.32414 12H6.90791C9.16427 12 11 10.056 11 7.66557C11 5.27619 9.16427 3.33223 6.90791 3.33223Z" fill="#272727"/>
                    </svg>
                    {{ __('Возврат товара') }}
                </a>
                <a href="{{ route('page.info.delivery') }}">
                    <svg width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M7.04687 0C6.67882 0 6.31725 0.0967294 5.99837 0.280481L3.76264 1.55804C3.61406 1.58696 3.47543 1.66368 3.37146 1.78157L1.09957 3.07979L1.09687 3.08135C0.836945 3.23142 0.612904 3.43505 0.439138 3.67785C0.398071 3.71942 0.361576 3.76685 0.330953 3.81978C0.304804 3.86499 0.284273 3.9119 0.269146 3.95971C0.123561 4.25044 0.0472097 4.57156 0.046875 4.89785V10.4993C0.0472527 10.8675 0.144465 11.2292 0.32876 11.5481C0.513054 11.8669 0.77795 12.1317 1.09687 12.3158L1.09958 12.3173L5.99687 15.1158L5.99817 15.1165C6.21967 15.2442 6.46178 15.3299 6.71236 15.3703C6.81132 15.4239 6.92463 15.4543 7.04505 15.4543C7.16485 15.4543 7.27762 15.4242 7.37621 15.3711C7.62864 15.3311 7.87258 15.2451 8.09562 15.1165L8.09687 15.1158L12.9942 12.3173L12.9969 12.3158C13.3158 12.1317 13.5807 11.8669 13.765 11.5481C13.9493 11.2292 14.0465 10.8675 14.0469 10.4993V4.89785C14.0465 4.57552 13.972 4.25822 13.8299 3.97029C13.8145 3.91882 13.7929 3.86832 13.7648 3.81978C13.7324 3.76382 13.6935 3.71401 13.6495 3.67078C13.4765 3.43109 13.2543 3.22995 12.9969 3.08134L8.09687 0.281347L8.09541 0.280504C7.77653 0.0967374 7.41494 0 7.04687 0ZM7.74505 13.7044L12.2969 11.1033L12.298 11.1027C12.4038 11.0414 12.4917 10.9533 12.5529 10.8474C12.6143 10.7412 12.6467 10.6206 12.6469 10.4978V5.27515L7.74505 8.11068V13.7044ZM6.34505 8.10741L1.44687 5.27399V10.4981C1.44705 10.6208 1.47945 10.7413 1.54084 10.8474C1.60205 10.9533 1.68996 11.0414 1.79577 11.1027L1.79687 11.1033L6.34505 13.7023V8.10741ZM7.39687 1.49379L11.9199 4.07834L10.2007 5.07282L5.33941 2.26949L6.69418 1.49534L6.69687 1.49378C6.80329 1.43234 6.924 1.4 7.04687 1.4C7.16975 1.4 7.29046 1.43235 7.39687 1.49379ZM7.04788 6.89661L8.80162 5.88213L3.93177 3.07385L2.17491 4.07777L7.04788 6.89661Z" fill="#2E3338"/>
                    </svg>
                    {{ __('Доставка') }}
                </a>
                <a href="{{ route('page.info.payment') }}">
                    <svg width="15" height="16" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M13.0625 3.66602H8.9375C6.02068 3.66602 4.56228 3.66602 3.65614 4.58654C2.75 5.50706 2.75 6.98862 2.75 9.95173V12.047C2.75 15.0101 2.75 16.4916 3.65614 17.4122C4.56228 18.3327 6.02068 18.3327 8.9375 18.3327H13.0625C15.9793 18.3327 17.4377 18.3327 18.3439 17.4122C19.25 16.4916 19.25 15.0101 19.25 12.047V9.95173C19.25 6.98862 19.25 5.50706 18.3439 4.58654C17.4377 3.66602 15.9793 3.66602 13.0625 3.66602Z" stroke="#2E3338" stroke-width="1.6"/>
                        <path d="M6.41699 7.33398H9.16699" stroke="#2E3338" stroke-width="1.6" stroke-linecap="round"/>
                        <path d="M17.4167 14.666H15.5833C14.8015 14.666 14.4105 14.666 14.1412 14.4594C14.0719 14.4062 14.0098 14.3441 13.9566 14.2748C13.75 14.0055 13.75 13.6145 13.75 12.8327C13.75 12.0508 13.75 11.6599 13.9566 11.3906C14.0098 11.3213 14.0719 11.2592 14.1412 11.206C14.4105 10.9993 14.8015 10.9993 15.5833 10.9993H17.4167C18.1985 10.9993 18.5895 10.9993 18.8588 11.206C18.9281 11.2592 18.9902 11.3213 19.0434 11.3906C19.25 11.6599 19.25 12.0508 19.25 12.8327C19.25 13.6145 19.25 14.0055 19.0434 14.2748C18.9902 14.3441 18.9281 14.4062 18.8588 14.4594C18.5895 14.666 18.1985 14.666 17.4167 14.666Z" stroke="#2E3338" stroke-width="1.6"/>
                    </svg>
                    {{ __('Способы оплаты') }}
                </a>
                <a href="{{ route('page.info.size_guide') }}">
                    <svg width="15" height="16" viewBox="0 0 17 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0.296178 1.3333L0.270733 7.06881C0.271119 7.16353 0.290198 7.25724 0.326878 7.34457C0.363557 7.4319 0.417113 7.51113 0.484478 7.57772C0.618549 7.71067 0.799496 7.78561 0.988307 7.78638L15.4161 7.81183C15.6063 7.81126 15.7884 7.73548 15.9229 7.60103C16.0573 7.46658 16.1331 7.28439 16.1337 7.09425L16.1337 1.3333C16.1333 1.23858 16.1142 1.14487 16.0776 1.05754C16.0409 0.970208 15.9873 0.890976 15.9199 0.824386C15.7859 0.691439 15.6049 0.616502 15.4161 0.61573L12.5356 0.615729L3.89423 0.61573L1.01375 0.615729C0.823614 0.616295 0.641424 0.692078 0.506976 0.826527C0.372527 0.960976 0.296745 1.14316 0.296178 1.3333ZM3.17665 2.05597L3.17665 2.77863C3.17722 2.96877 3.253 3.15096 3.38745 3.28541C3.5219 3.41985 3.70409 3.49564 3.89423 3.4962C3.98924 3.49659 4.08338 3.47817 4.17124 3.44199C4.25909 3.40581 4.33891 3.35259 4.40609 3.28541C4.47328 3.21823 4.52649 3.13841 4.56267 3.05055C4.59885 2.9627 4.61728 2.86855 4.61689 2.77354L4.61689 2.05088L6.05713 2.05597V4.21378C6.07111 4.39451 6.15277 4.56331 6.2858 4.68644C6.41883 4.80958 6.59343 4.87798 6.7747 4.87798C6.95597 4.87798 7.13057 4.80958 7.2636 4.68644C7.39663 4.56331 7.47829 4.39451 7.49227 4.21378V2.05597H8.9376L8.93251 2.77354C8.93251 2.9652 9.00865 3.14901 9.14417 3.28454C9.2797 3.42007 9.46351 3.4962 9.65517 3.4962C9.84684 3.4962 10.0306 3.42007 10.1662 3.28454C10.3017 3.14901 10.3778 2.9652 10.3778 2.77354L10.3727 2.05597L11.813 2.05088L11.8181 4.21378C11.8186 4.40392 11.8944 4.58611 12.0289 4.72055C12.1633 4.855 12.3455 4.93079 12.5356 4.93135C12.7258 4.93079 12.908 4.855 13.0424 4.72055C13.1769 4.5861 13.2527 4.40392 13.2532 4.21378V2.05597L14.6935 2.05088L14.6935 6.37668L1.73642 6.37668L1.73642 2.05088L3.17665 2.05597Z" fill="#5A5A5A"/>
                    </svg>
                    {{ __('Гид по размерам') }}
                </a>
            </div>
            <a href="#" class="btn-black">{{ __('Раздел поддержки') }}</a>
            <div class="online-functions flex">
                <a href="#" data-type="feedback" class="customer-request">{{ __('Личный звонок-1') }}</a>
                <a href="#" data-type="feedback" class="customer-request">{{ __('Напишите нам-1') }}</a>
            </div>
        </div>
    </div>
</div>

{{--<div class="remodal repair-modal" data-remodal-id="video-consultation">--}}
{{--    <button data-remodal-action="close" class="remodal-close"></button>--}}

{{--    <div class="modal-body flex tabos">--}}
{{--        @desktop--}}
{{--        <img src="{{ asset('i/icons/video-consultation.png') }}" alt="" class="cusimage">--}}
{{--        @enddesktop--}}
{{--        <div class="repair-block flex column space-between">--}}
{{--            <p class="title">{!! __('Видео Консультация') !!}</p>--}}
{{--            <div class="heighted flex column space-between">--}}
{{--                <div class="repair-forms">--}}
{{--                    <div class="repair-tab active" data-tab="clear">--}}
{{--                        <form action="{{ route('page.contact.action') }}" class="form styled" method="post">--}}
{{--                            @csrf--}}
{{--                            <div class="form-group">--}}
{{--                                <div class="dropdown lefted sorting theme-choose">--}}
{{--                                    <input type="hidden" name="theme" value="">--}}
{{--                                    <a href="#" class="element link flex">{{ __('Тема консультации') }} <img src="{{ url('i/icons/arrow-down-sort.svg') }}" alt=""></a>--}}
{{--                                    <div class="droppable">--}}
{{--                                        <p><a href="#">{{ __('Консультация по ювелирным изделиям') }}</a></p>--}}
{{--                                        <p><a href="#">{{ __('Консультация по бренду ZARDOZI') }}</a></p>--}}
{{--                                        <p><a href="#">{{ __('Оформление заказа') }}</a></p>--}}
{{--                                        <p><a href="#">{{ __('Возват товара') }}</a></p>--}}
{{--                                        <p><a href="#">{{ __('Ремонт/Чистка ювелирных изделий') }}</a></p>--}}
{{--                                        <p><a href="#">{{ __('Возврат денежных средств') }}</a></p>--}}
{{--                                    </div>--}}
{{--                                </div>--}}
{{--                                @error('theme') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--                            </div>--}}
{{--                            <div class="form-group @error('cus_name') form-error @enderror">--}}
{{--                                <label for="">{{ __('Имя') }}</label>--}}
{{--                                @error('cus_name') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--                                <input type="text" name="cus_name" placeholder="{{ __('Ваше имя') }}" required>--}}
{{--                            </div>--}}
{{--                            <div class="form-group @error('cus_phone') form-error @enderror">--}}
{{--                                <label for="">{{ __('Телефон') }}</label>--}}
{{--                                @error('cus_phone') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--                                <input type="text" name="cus_phone" rel="phone" placeholder="+7 (---) --- -- --" required>--}}
{{--                            </div>--}}
{{--                            <div class="form-group @error('cus_time_from') form-error @enderror">--}}
{{--                                <label for="">{{ __('Удобное время звонка') }}</label>--}}
{{--                                @error('cus_time_from') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--                                <div class="double flex space-between item-center">--}}
{{--                                    <input type="text" name="cus_time_from" placeholder="с 00:00" rel="time" required>--}}
{{--                                    <input type="text" name="cus_time_to" placeholder="до 00:00" rel="time" required>--}}
{{--                                </div>--}}
{{--                            </div>--}}
{{--                            <div class="form-group">--}}
{{--                                <button type="submit" class="btn-black">{{ __('Заказать консультацию') }}</button>--}}
{{--                            </div>--}}
{{--                        </form>--}}
{{--                    </div>--}}
{{--                </div>--}}
{{--            </div>--}}
{{--        </div>--}}
{{--    </div>--}}
{{--</div>--}}

{{--<div class="remodal" data-remodal-id="send-resume">--}}
{{--    <button data-remodal-action="close" class="remodal-close"></button>--}}
{{--    <h2>Отправка резюме</h2>--}}

{{--    <form action="{{ route('send-resume.index') }}" method="post" enctype="multipart/form-data" class="form styled minified">--}}
{{--        @csrf--}}
{{--        <div class="form-group @error('surname') form-error @enderror">--}}
{{--            <label for="surname">{{ __('Фамилия') }}</label>--}}
{{--            @error('surname') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--            <div class="infoed">--}}
{{--                <input type="text" name="surname" id="surname" placeholder="Введи фамилию">--}}
{{--            </div>--}}
{{--        </div>--}}

{{--        <div class="form-group @error('name') form-error @enderror">--}}
{{--            <label for="name">{{ __('Имя') }}</label>--}}
{{--            @error('name') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--            <div class="infoed">--}}
{{--                <input type="text" name="name" id="name" placeholder="Введи имя">--}}
{{--            </div>--}}
{{--        </div>--}}
{{--        <div class="form-group @error('file') form-error @enderror">--}}
{{--            <label for="resume">{{ __('Резюме') }}</label>--}}
{{--            @error('file') <span class="error-msg">{{ $message }}</span> @enderror--}}
{{--            <div class="infoed">--}}
{{--                <input type="file" name="file">--}}
{{--            </div>--}}
{{--        </div>--}}
{{--        <input type="hidden" name="careers_id" id="careers_id" value="{{ $career->id ?? '' }}">--}}
{{--        <button class="btn-black" type="submit">{{ __('Отправить') }}</button>--}}
{{--    </form>--}}
{{--</div>--}}

<div class="remodal" data-remodal-id="payment-error">
    <button data-remodal-action="close" class="remodal-close"></button>
    <div class="modal-body">
        <img src="{{ asset('i/icons/error.svg') }}" alt="">
        <span>@if(session()->has('payment_message')){{ session('payment_message') }}@endif</span>
        <p>@if(session()->has('payment_status')){{ session('payment_status') }}@endif</p>
        <a href="{{ url('/') }}">
            {!! __('Оформить заново') !!}
        </a>
    </div>
</div>
