@php
    $currentLanguage = app()->getLocale() ?? 'ru';

    $rename_categoryJson = File::get(database_path('files/catalog-rename-category.json'));
    $rename_categoryLocaled = json_decode($rename_categoryJson, true)[$currentLanguage]
@endphp
<nav>
    <div id="menuToggle">
        <input type="checkbox" id="hamburger-checkbox"/>

        <span class="line"></span>
        <span class="line"></span>


        <div id="menu" class="">
            <div class="menu-nav">
                <a href="{{ route('page.index') }}" class="menu-logo">
                    <svg width="80" height="65" viewBox="0 0 150 140" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M110.987 30.3657C110.473 31.7023 110.165 33.3473 109.651 34.7866C108.417 38.7963 106.361 43.0117 104.099 46.3017C102.043 49.3861 98.5471 53.1902 95.6684 55.1436C94.5374 55.9661 92.584 57.3027 91.9671 55.9661C91.453 54.8352 94.0233 39.4132 94.5374 36.3288C94.743 35.3007 94.8458 34.1698 95.1543 33.2444C95.4627 32.0107 95.874 31.5994 95.3599 30.3657L94.8458 30.4685C93.6121 33.5529 91.9671 44.7595 91.453 48.9748C91.2474 51.0311 91.0418 53.4986 90.6305 55.452C89.4996 55.2464 88.163 54.5267 87.0321 54.1155C83.8449 53.1902 83.6392 55.452 84.5645 56.583C86.9292 59.1533 88.9855 58.5364 90.2193 59.2561C90.3221 60.3871 90.0136 62.8546 89.9108 64.0883C89.7052 66.453 89.0883 74.164 90.3221 76.0146C90.5277 76.3231 91.2474 76.9399 91.8643 76.8371C91.8643 76.8371 92.3783 76.8371 91.7615 76.1174C91.7615 76.1174 91.3502 75.809 91.2474 75.7062C90.939 75.3978 90.939 74.9865 90.8361 74.3696C90.2193 70.874 91.0418 64.7052 91.3502 60.7983C91.453 59.6674 91.453 58.4336 92.8924 58.7421C94.3318 58.9477 107.286 68.5093 112.016 68.7149C114.483 68.8177 115.82 66.7615 115.408 65.5277C115.306 65.2193 115.408 65.4249 115.203 65.2193C113.866 64.2939 114.894 68.7149 109.959 66.8643C107.8 66.0418 95.5655 59.1533 94.743 57.9195C94.9487 57.5083 97.4162 56.0689 98.6499 54.938C104.922 49.0776 108.726 42.7032 111.296 34.0669C111.913 31.9079 113.969 25.0194 113.249 22.9631C111.913 22.9631 112.016 25.3278 111.81 26.5616C111.502 27.6925 111.193 29.0291 110.987 30.3657ZM130.625 60.9011C131.447 59.7702 132.064 58.9477 134.943 60.7983C135.56 61.2096 136.691 60.6955 138.233 60.0786C140.495 59.1533 143.476 57.8167 147.589 58.3308C147.795 58.3308 148 58.5364 148 58.8449C148 59.0505 147.795 59.2561 147.486 59.2561C143.682 58.8449 140.7 60.0786 138.644 61.0039C136.896 61.7236 135.56 62.3405 134.532 61.6208C132.27 60.1814 131.859 60.6955 131.344 61.518C131.036 61.9293 130.728 62.3405 130.316 62.6489C129.699 63.3686 128.363 63.4714 127.438 61.6208C126.923 60.5927 126.307 56.7886 125.587 56.2745C124.559 57.097 122.605 63.0602 121.886 64.808C121.372 66.1446 121.166 66.9671 119.829 66.7615C118.287 64.3968 119.624 58.0224 119.521 55.8633C118.596 56.4802 119.11 57.7139 116.951 60.1814C116.539 60.5927 115.717 61.7236 114.792 60.7983C114.072 60.0786 114.38 58.8449 113.866 58.1252C113.147 58.8449 111.913 62.4433 110.371 61.3124C109.137 60.3871 110.371 55.1436 112.53 53.293C113.352 52.5733 114.483 52.9845 114.997 53.6014C115.82 54.7323 114.38 58.5364 115.717 59.9758C117.362 59.7702 119.932 52.3676 120.652 50.3114C120.858 49.6945 121.063 49.0776 121.269 48.4608C121.474 47.7411 121.474 47.0214 122.297 47.0214C123.017 47.7411 122.194 50.2086 121.988 51.3395C121.372 54.2183 119.315 63.3686 120.652 65.2193C121.886 64.0883 124.045 53.3958 126.615 55.0408C127.232 55.452 127.438 56.4802 127.643 57.4055C127.952 58.8449 128.157 61.8264 129.391 62.2377C129.802 62.0321 130.316 61.4152 130.625 60.9011ZM110.782 60.2843C110.473 59.2561 111.913 53.807 113.763 53.807C114.072 54.938 112.632 57.9195 111.913 59.1533C111.707 59.7702 111.502 60.1814 110.782 60.2843ZM69.9651 67.1727C69.451 65.1165 72.3298 58.8449 74.3861 59.3589C74.3861 60.3871 73.6664 59.873 73.3579 61.3124C72.7411 62.9574 71.5073 66.8643 69.9651 67.1727ZM46.7294 59.873C46.2153 61.8264 43.8506 67.3783 42.5141 67.4812C41.6916 66.5558 41.8972 64.3968 42.1028 63.0602C42.2056 61.4152 41.7944 60.2843 40.0466 60.2843C37.8875 61.8264 37.065 63.7799 36.8594 66.6586C36.7565 67.4812 36.7565 68.3037 37.2706 68.7149C38.8128 69.8459 39.8409 66.453 40.7662 65.5277C41.3831 66.2474 41.0747 67.4812 41.6916 68.2008C43.0281 69.5374 44.9816 66.2474 45.29 65.5277C45.5985 64.808 45.9069 63.6771 46.421 63.2658C46.5238 65.4249 45.1872 71.7993 46.7294 74.164C48.1688 74.4724 48.2716 73.5471 48.7857 72.2105C49.5053 70.3599 51.4588 64.4996 52.4869 63.6771C53.2066 64.1911 53.7207 67.7896 54.2347 68.9205C55.5713 71.5937 57.4219 70.3599 57.6276 69.3318C58.0388 68.4065 58.5529 66.7615 58.8613 65.7333C59.4782 63.7799 60.3007 60.0786 61.226 58.6392C61.8429 59.2561 62.4598 66.1446 65.647 67.1727C67.1892 67.584 68.0117 66.453 68.7314 66.0418C68.7314 66.7615 68.7314 67.7896 69.1426 68.2008C69.7595 68.8177 70.582 68.3037 70.9932 67.8924C72.3298 66.5558 72.5354 65.2193 73.2551 64.7052C73.7692 65.4249 73.9748 66.0418 75.1058 66.3502C76.2367 66.5558 77.2648 66.0418 77.8817 65.5277C79.4239 64.3968 80.0408 63.5743 80.6577 61.2096C79.5267 61.6208 79.5267 63.3686 77.7789 64.6024C76.4423 65.6305 74.7973 66.3502 74.1804 63.9855C73.9748 63.3686 73.872 61.6208 74.1804 61.1067C74.5917 60.4899 75.9283 60.7983 75.0029 59.2561C72.9467 55.6577 69.3482 63.6771 69.1426 63.9855C63.7963 71.2852 62.871 57.9195 61.6373 57.4055C60.4035 57.097 60.3007 58.228 59.8894 59.2561C59.4782 60.1814 59.1698 61.1067 58.8613 62.1349C58.3473 63.6771 57.6276 66.7615 56.9079 67.8924C56.3938 67.1727 56.3938 61.0039 56.291 59.6674C56.291 58.228 56.291 56.7886 56.291 55.2464C56.291 54.4239 56.7022 51.648 56.5994 51.2367C55.4685 50.7226 55.4685 52.4705 55.2629 54.4239C54.9544 58.0224 55.1601 64.808 55.6741 68.2008C55.7769 68.7149 55.7769 69.3318 55.9826 69.743C54.0291 69.743 54.7488 58.7421 51.2532 63.5743C50.0194 65.2193 47.8603 72.2105 47.2435 72.8274C45.9069 70.9768 47.9631 61.7236 48.58 58.9477C48.7856 57.8167 49.6082 55.3492 48.8885 54.6295C47.8603 54.5267 47.6547 58.5364 46.7294 59.873ZM37.7847 67.6868C37.4762 66.6586 38.9156 61.2096 40.7662 61.2096C41.0747 62.1349 40.1494 63.9855 39.7381 64.9108C39.5325 65.5277 39.2241 65.939 38.9156 66.5558C38.71 67.0699 38.5044 67.584 37.7847 67.6868ZM29.5596 38.1795C33.775 36.9457 37.4762 36.1232 38.8128 36.3288C39.224 35.9176 38.9156 35.9176 39.8409 35.9176C39.6353 36.5345 39.8409 36.4316 39.3269 36.7401C39.1212 37.871 37.579 39.516 36.9622 40.2357C32.9525 44.8623 29.1484 49.3861 25.2415 53.9098L25.3443 52.4705C25.5499 50.6198 28.0174 43.7314 29.5596 38.1795ZM26.8865 39.002C27.4006 38.7963 28.0174 38.6935 28.5315 38.4879V38.5907L26.6809 44.8623C26.6809 44.9651 26.4752 45.1707 26.4752 45.2736C26.2696 45.582 26.3724 45.3764 26.1668 45.582C25.9612 45.0679 26.2696 42.1892 26.8865 39.002ZM28.7371 37.6654C28.2231 37.871 27.6062 37.9738 27.0921 38.1795C27.8118 34.8895 28.7371 31.5994 29.7653 30.8797C30.3821 32.1135 29.354 35.712 28.7371 37.6654ZM37.2706 35.5063C35.3172 35.8148 32.644 36.5345 29.7653 37.357C30.1765 35.8148 30.4849 34.3754 30.5878 33.2444C30.7934 31.291 30.999 28.9263 28.8399 29.9544C28.5315 30.7769 27.8118 31.8051 27.2977 32.936C26.8865 33.9641 26.5781 35.0951 26.2696 36.1232C26.1668 36.6373 26.064 37.4598 25.8584 38.4879C19.6896 40.4413 13.3152 42.6004 10.7449 43.3201C10.8477 42.9089 11.1561 42.3948 10.5392 42.292C10.128 42.1892 9.71673 42.4976 9.61392 42.7032C8.79142 43.7314 8.48298 47.6383 13.9321 44.1426C16.0911 42.806 20.9233 40.8526 25.8584 39.3104C25.2415 43.7314 24.419 51.1339 23.9049 55.452C21.9515 57.7139 19.998 60.0786 17.9418 62.4433C14.3433 66.7615 11.1561 71.0796 7.66047 75.809C6.94078 76.7343 -3.44333 89.0719 1.18326 90.3056C2.41701 90.7169 2.82826 90.6141 4.16483 90.4084C6.01547 90.9225 55.1601 71.7993 58.9641 75.3977C60.3007 75.809 60.8148 77.6596 61.5345 76.9399C62.1513 76.1174 60.3007 74.3696 59.581 74.2668C50.9447 70.874 16.6052 85.4734 8.07172 88.0437C7.55766 88.2494 7.45485 88.2494 6.94078 88.3522C5.29578 88.5578 2.93108 89.6887 1.38888 88.7634C1.18326 87.2212 2.21139 85.8847 2.93108 84.5481C6.3239 78.5849 15.9883 66.5558 20.1008 61.4152C21.3346 59.873 22.5683 58.5364 23.6993 57.097L23.4937 58.5364C24.0077 62.0321 21.8487 73.7527 23.5965 75.1921C24.6246 74.4724 24.6246 72.7246 25.0359 71.1824C25.5499 69.0233 28.2231 59.873 29.6624 59.5646C30.1765 60.1814 30.3821 62.8546 30.4849 63.8827C30.7934 65.3221 31.2046 66.5558 31.7187 67.7896C34.1862 73.1359 37.3734 70.3599 36.9622 69.1262C35.8312 68.9205 35.2143 70.9768 33.775 69.4346C33.0553 68.7149 32.644 67.4811 32.2328 66.3502C31.6159 64.6024 31.2046 60.1814 30.4849 58.9477C28.3259 54.938 24.7274 67.6868 24.3162 69.6402C24.0077 69.3318 24.2134 69.6402 24.1105 69.229C23.9049 68.8177 24.3162 64.2939 24.3162 63.7799L24.933 55.3492L25.1387 55.0408C27.8118 51.8536 39.5325 38.7963 40.5606 36.226C40.6634 34.6838 40.355 34.581 38.8128 34.6838H38.2987C37.9903 34.9923 38.5044 34.7866 37.6819 35.0951C37.6819 35.5063 37.4762 35.5063 37.2706 35.5063ZM122.4 70.1543V99.0447H22.5684V86.7072H23.288V98.325H121.68V70.0515H122.4V70.1543ZM22.9796 17.1028H122.503V43.7314H121.783V17.7197H23.288V35.3007H22.5684C22.5684 30.0572 22.5684 22.2435 22.5684 17H22.9796V17.1028ZM35.8312 109.223L33.3637 113.13H35.934V113.541H32.8496V113.13L35.3172 109.223H32.9525V108.812H35.8312V109.223ZM45.0844 113.541H44.5703V111.279H42.2056V113.541H41.6916V108.812H42.2056V110.868H44.5703V108.812H45.0844V113.541ZM52.0757 111.691H53.6179L52.7954 109.223L52.0757 111.691ZM53.7207 112.102H51.87L51.4588 113.541H50.9447L52.4869 108.812H53.2066L54.7488 113.541H54.2347L53.7207 112.102ZM63.8992 108.812V113.541H63.2823L61.0204 109.532V113.541H60.6091V108.812H61.226L63.4879 112.822V108.812H63.8992ZM73.6664 108.812V113.541H73.0495L70.7876 109.532V113.541H70.3764V108.812H70.9932L73.2551 112.822V108.812H73.6664ZM80.5548 111.691H82.097L81.2745 109.223L80.5548 111.691ZM82.1999 112.102H80.3492L79.938 113.541H79.4239L80.9661 108.812H81.6858L83.228 113.541H82.7139L82.1999 112.102ZM91.9671 111.279L91.3502 112.102V113.541H90.8361V108.812H91.3502V111.382L93.4065 108.812H93.9205L92.2755 110.868L94.229 113.439H93.6121L91.9671 111.279ZM100.398 111.691H101.94L101.117 109.223L100.398 111.691ZM102.043 112.102H100.295L99.8837 113.541H99.2668L100.809 108.812H101.529L103.071 113.541H102.557L102.043 112.102ZM112.221 108.812V113.541H111.604L109.342 109.532V113.541H108.931V108.812H109.548L111.81 112.822V108.812H112.221ZM62.1513 122.486H61.8429V122.178C61.7401 122.28 61.6373 122.383 61.4316 122.486C61.226 122.589 61.1232 122.589 60.9176 122.589C60.7119 122.589 60.5063 122.589 60.3007 122.486C60.0951 122.383 59.9923 122.28 59.8894 122.075C59.7866 121.869 59.7866 121.664 59.7866 121.458V120.533C59.7866 120.224 59.7866 120.019 59.8894 119.813C59.9923 119.607 60.0951 119.504 60.3007 119.299C60.5063 119.196 60.7119 119.093 60.9176 119.093C61.1232 119.093 61.3288 119.093 61.5345 119.196C61.7401 119.299 61.8429 119.402 61.9457 119.504L61.7401 119.71C61.6373 119.607 61.5345 119.504 61.4316 119.402C61.3288 119.299 61.1232 119.299 60.9176 119.299C60.6091 119.299 60.4035 119.402 60.3007 119.607C60.1979 119.813 60.0951 120.019 60.0951 120.327V121.252C60.0951 121.561 60.1979 121.766 60.3007 121.869C60.4035 122.075 60.6091 122.075 60.9176 122.075C61.1232 122.075 61.226 122.075 61.4316 121.972C61.5345 121.869 61.6373 121.766 61.7401 121.664V120.944H60.9176V120.635H62.1513V122.486ZM66.6751 120.841C66.8807 120.841 67.0864 120.841 67.1892 120.738C67.292 120.635 67.3948 120.533 67.3948 120.327V120.121C67.3948 119.916 67.292 119.813 67.1892 119.71C67.0864 119.607 66.8807 119.607 66.6751 119.607H66.0582V120.944H66.6751V120.841ZM67.4976 122.486L66.7779 121.15C66.7779 121.15 66.7779 121.15 66.6751 121.15H66.0582V122.486H65.7498V119.196H66.6751C66.9835 119.196 67.292 119.299 67.4976 119.402C67.7032 119.504 67.806 119.71 67.806 120.019V120.224C67.806 120.43 67.7032 120.533 67.6004 120.738C67.4976 120.841 67.292 120.944 67.0863 121.047L67.9089 122.486H67.4976ZM72.4326 119.402C72.1242 119.402 71.9186 119.505 71.7129 119.71C71.6101 119.916 71.5073 120.121 71.5073 120.43V121.15C71.5073 121.458 71.6101 121.664 71.7129 121.869C71.8157 122.075 72.1242 122.178 72.4326 122.178C72.7411 122.178 72.9467 122.075 73.1523 121.869C73.2551 121.664 73.3579 121.458 73.3579 121.15V120.43C73.3579 120.121 73.2551 119.813 73.1523 119.71C72.9467 119.505 72.7411 119.402 72.4326 119.402ZM72.4326 119.196C72.8439 119.196 73.1523 119.299 73.3579 119.607C73.5636 119.813 73.6664 120.224 73.6664 120.533V121.252C73.6664 121.458 73.6664 121.766 73.5636 121.972C73.4608 122.178 73.3579 122.28 73.1523 122.486C72.9467 122.589 72.7411 122.692 72.4326 122.692C72.1242 122.692 71.9186 122.589 71.7129 122.486C71.5073 122.383 71.4045 122.178 71.3017 121.972C71.1989 121.766 71.1989 121.561 71.1989 121.252V120.533C71.1989 120.121 71.3017 119.813 71.5073 119.607C71.7129 119.299 72.0214 119.196 72.4326 119.196ZM79.5267 121.458C79.5267 121.766 79.4239 122.075 79.2183 122.28C79.0127 122.486 78.7042 122.589 78.293 122.589C77.8817 122.589 77.5733 122.486 77.3676 122.28C77.162 122.075 77.0592 121.766 77.0592 121.458V119.196H77.3676V121.458C77.3676 121.664 77.4705 121.869 77.5733 122.075C77.6761 122.178 77.8817 122.28 78.1902 122.28C78.4986 122.28 78.7042 122.178 78.807 122.075C78.9098 121.972 79.0127 121.766 79.0127 121.458V119.196H79.3211V121.458H79.5267ZM84.873 120.121C84.873 119.916 84.7702 119.71 84.6674 119.607C84.5646 119.504 84.3589 119.402 84.0505 119.402H83.4336V120.944H83.9477C84.2561 120.944 84.4617 120.841 84.5645 120.738C84.6674 120.635 84.7702 120.43 84.7702 120.224V120.121H84.873ZM84.0505 119.196C84.3589 119.196 84.6674 119.299 84.873 119.402C85.0786 119.607 85.1814 119.813 85.1814 120.121V120.327C85.1814 120.635 85.0786 120.841 84.873 121.047C84.6674 121.252 84.3589 121.252 83.9477 121.252H83.4336V122.486H83.1252V119.196H84.0505ZM85.5927 55.452C86.9292 55.1436 90.0136 56.3774 90.4249 57.4055C89.6024 57.8167 88.163 57.6111 87.3405 57.3027C86.6208 56.8914 85.4899 56.2745 85.5927 55.452Z" fill="#23272A"/>
                    </svg>
                </a>
                @guest
                    <div class="dropdown lr-block tabos">
                        <a class="element link flex menu-login @if($errors->login->any() || $errors->register->any()) active @endif"><img src="{{ url('i/icons/lock.svg') }}" alt="">{{ __('Вход') }}</a>
                        <div class="droppable login @if($errors->login->any() || $errors->register->any()) active @endif">
                            <a class="close-dropdown"><img src="{{ url('i/icons/close-black.svg') }}" alt=""></a>
                            <div class="login-register">
                                <div class="flex divider">
                                    <a href="#" class="menu-login @if($errors->login->any()) active @endif @if(!$errors->register->any()) active @endif " data-link-tab="login">{{ __('Вход') }}</a>
                                    <a href="#" @if($errors->register->any()) class="active" @endif data-link-tab="register">{{ __('Регистрация') }}</a>
                                </div>
                                <div class="divider-content">
                                    {{--login--}}
                                    <div data-tab="login" class="@if($errors->login->any()) active @endif @if(!$errors->register->any()) active @endif">
                                        <form action="{{ route('auth.login') }}" class="form" method="post">
                                            @csrf
                                            <div class="form-group input-top @error('log_email', 'login') form-error @enderror">
                                                @error('log_email', 'login') <span class="error-msg">{{ $message }}</span> @enderror
                                                <input type="email" name="log_email" placeholder="Введите Email">
                                            </div>
                                            <div class="form-group input-top @error('log_password', 'login') form-error @enderror">
                                                @error('log_password', 'login') <span class="error-msg">{{ $message }}</span> @enderror
                                                <input type="password" class="password" name="log_password" placeholder="{{ __('Введите пароль') }}">
                                                <a href="#" class="forgot-password">{{ __('Забыли пароль?') }}</a>
                                            </div>
                                            <div class="form-group">
                                                <button type="submit">{{ __('Войти') }}</button>
                                            </div>
                                        </form>
                                        <a href="#" data-link-tab="register" class="no-account"><img src="{{ url('i/icons/reg-plus.svg') }}" alt=""> {{ __('У меня нет аккаунта') }}</a>
                                    </div>
                                    {{--register--}}
                                    <div data-tab="register" @if($errors->register->any()) class="active" @endif>
                                        <form action="{{ route('auth.register') }}" class="form register" method="post">
                                            @csrf
                                            <div class="form-group @error('reg_name', 'register') form-error @enderror">
                                                @error('reg_name', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                                                <input type="text" name="reg_name" placeholder="{{ __('Ваше имя') }}" value="{{ old('reg_name') }}">
                                            </div>
                                            <div class="form-group @error('reg_email', 'register') form-error @enderror">
                                                @error('reg_email', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                                                <input type="email" name="reg_email" placeholder="Email" value="{{ old('email') }}">
                                            </div>
                                            <div class="form-group @error('reg_password', 'register') form-error @enderror">
                                                @error('reg_password', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                                                <input type="password" class="password" name="reg_password" placeholder="{{ __('Пароль') }}">
                                            </div>
                                            <div class="form-group selects">
                                                <input type="hidden" name="reg_sex" value="female">
                                                <a href="#" class="active" data-sex="female">{{ __('Женщина') }}</a>
                                                <a href="#" data-sex="male">{{ __('Мужчина') }}</a>
                                            </div>
                                            <div class="form-group checkbox @error('rules_accept', 'register') form-error @enderror">
                                                <label for="rules-accept" class="remember wider">
                                                    <p><a href="#"></a>{!! __('Условия пользования') !!}</a></p>
                                                    <input type="checkbox" id="rules-accept" name="rules_accept"><p class="checkmark"></p>
                                                </label>
                                                @error('rules_accept', 'register') <span class="error-msg">{{ $message }}</span> @enderror
                                            </div>
                                            <div class="form-group">
                                                <button type="submit">{{ __('Стать участником') }}</button>
                                            </div>
                                        </form>
                                        <div class="welcome">
                                            <p>{{ __('Добро пожаловать в клуб!') }}</p>
                                            <img src="{{ url('i/icons/zhanna-v2.svg') }}" alt="">
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                @else
                    <div class="w-6 lr-block">
                        <a href="{{ url('/profile') }}" class="link flex">
                            <img src="{{ url('i/icons/lock-locked.svg') }}" alt="">{{ auth()->user()->name }}
                        </a>
                    </div>
                @endif


            </div>
            <div class="menu-content">
                <div class="menu-section">
                    <div class="sex">
                        @foreach($types as $type)
{{--                            ?sex--}}
                            <a href="{{ route('page.index', $type->slug) }}"
                                class="menu-link mob-menu-link {{ (request()->is($type->slug) || session('sex') == $type->slug) ? 'active' : '' }}">
                                {{ $type->getName() }}
                            </a>
                        @endforeach
                    </div>
{{--                    @foreach($active->categories->where('parent', 0) as $category)--}}
{{--                        <div class="menu-list">--}}
{{--                            Jewelry--}}
{{--                            @if($category->code == '3')--}}
{{--                                @foreach($productsCategories as $sub => $c1)--}}
{{--                                    @if($sub === 4)--}}
{{--                                        @php $subc = \App\Models\Category::find($sub); @endphp--}}
{{--                                        <p class="dropdown-list mobile-slideover title">{{ $subc->getName() ?? '' }} <img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>--}}
{{--                                        <div class="slidedown-element nav-item">--}}
{{--                                            @foreach($c1->groupBy('menu_id')->take(10) as $menu_id => $items)--}}
{{--                                                @php $menuItem = \App\Models\Menu::find($menu_id); @endphp--}}
{{--                                                @if(!empty($menuItem->slug))--}}
{{--                                                    <a class="cat-nav-link" href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $menuItem->slug]) }}">{{ $menuItem->getName() ?? '' }}--}}
{{--                                                        <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">--}}
{{--                                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0.21967 10.7699C-0.0732233 10.463 -0.0732233 9.96554 0.21967 9.6587L4.18934 5.5L0.21967 1.3413C-0.0732232 1.03446 -0.0732232 0.536971 0.21967 0.230131C0.512563 -0.0767097 0.987437 -0.0767097 1.28033 0.230131L5.78033 4.94442C6.07322 5.25126 6.07322 5.74874 5.78033 6.05558L1.28033 10.7699C0.987437 11.0767 0.512563 11.0767 0.21967 10.7699Z" fill="#272727"/>--}}
{{--                                                        </svg>--}}
{{--                                                    </a>--}}
{{--                                                @endif--}}
{{--                                            @endforeach--}}
{{--                                            <a href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => 'yuvelirnye-izdeliya']) }}" class="watch-all">{{ __('Смотреть все') }}</a>--}}
{{--                                        </div>--}}
{{--                                    @endif--}}
{{--                                @endforeach--}}
{{--                            @endif--}}
{{--                        </div>--}}
{{--                        <div class="menu-list">--}}
{{--                            --}}{{--Clothes--}}
{{--                            @if($category->code == '2')--}}
{{--                                @foreach($productsCategories as $sub => $c1)--}}
{{--                                    @if($sub === 3 || $sub === 8)--}}
{{--                                        @php $subc = \App\Models\Category::find($sub); @endphp--}}
{{--                                        <p class="dropdown-list mobile-slideover title">{{ $category->getName() }}<img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>--}}
{{--                                        <div class="slidedown-element nav-item">--}}
{{--                                            @foreach($c1->groupBy('menu_id')->take(10) as $menu_id => $items)--}}
{{--                                                @php $menuItem = \App\Models\Menu::find($menu_id); @endphp--}}
{{--                                                @if(!empty($menuItem->slug))--}}
{{--                                                    <a class="cat-nav-link" href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $menuItem->slug]) }}">{{ $menuItem->getName() ?? '' }}--}}
{{--                                                        <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">--}}
{{--                                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0.21967 10.7699C-0.0732233 10.463 -0.0732233 9.96554 0.21967 9.6587L4.18934 5.5L0.21967 1.3413C-0.0732232 1.03446 -0.0732232 0.536971 0.21967 0.230131C0.512563 -0.0767097 0.987437 -0.0767097 1.28033 0.230131L5.78033 4.94442C6.07322 5.25126 6.07322 5.74874 5.78033 6.05558L1.28033 10.7699C0.987437 11.0767 0.512563 11.0767 0.21967 10.7699Z" fill="#272727"/>--}}
{{--                                                        </svg>--}}
{{--                                                    </a>--}}
{{--                                                @endif--}}
{{--                                            @endforeach--}}
{{--                                            <a href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => 'odezhda']) }}" class="watch-all">{{ __('Смотреть все') }}</a>--}}
{{--                                        </div>--}}
{{--                                    @endif--}}
{{--                                @endforeach--}}
{{--                            @endif--}}
{{--                        </div>--}}
{{--                        <div class="menu-list">--}}
{{--                            --}}{{--Interior--}}
{{--                            @if($category->code == '1')--}}
{{--                                @foreach($productsCategories as $sub => $c1)--}}
{{--                                    @if($sub === 6 || $sub === 7)--}}
{{--                                        @php $subc = \App\Models\Category::find($sub); @endphp--}}
{{--                                        <p class="dropdown-list mobile-slideover title">{{ $category->getName() }}<img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>--}}
{{--                                        <div class="slidedown-element nav-item">--}}
{{--                                            @foreach($c1->groupBy('menu_id')->take(10) as $menu_id => $items)--}}
{{--                                                @php $menuItem = \App\Models\Menu::find($menu_id); @endphp--}}
{{--                                                @if(!empty($menuItem->slug))--}}
{{--                                                    <a class="cat-nav-link" href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $menuItem->slug]) }}">{{ $menuItem->getName() ?? '' }}--}}
{{--                                                        <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">--}}
{{--                                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M0.21967 10.7699C-0.0732233 10.463 -0.0732233 9.96554 0.21967 9.6587L4.18934 5.5L0.21967 1.3413C-0.0732232 1.03446 -0.0732232 0.536971 0.21967 0.230131C0.512563 -0.0767097 0.987437 -0.0767097 1.28033 0.230131L5.78033 4.94442C6.07322 5.25126 6.07322 5.74874 5.78033 6.05558L1.28033 10.7699C0.987437 11.0767 0.512563 11.0767 0.21967 10.7699Z" fill="#272727"/>--}}
{{--                                                        </svg>--}}
{{--                                                    </a>--}}
{{--                                                @endif--}}
{{--                                            @endforeach--}}
{{--                                            <a href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => 'interer']) }}" class="watch-all">{{ __('Смотреть все') }}</a>--}}
{{--                                        </div>--}}
{{--                                    @endif--}}
{{--                                @endforeach--}}
{{--                            @endif--}}
{{--                        </div>--}}
{{--                    @endforeach--}}
                    <div class="menu-list">
                        {{--Jewelry--}}
                        @php
                            $category = $categories->where('code', 3)->first();
                            $subcategories = $subCategories->whereIn('id', [4, 5]);
                        @endphp
                        <p class="dropdown-list mobile-slideover title">{{ $category->getName() }} <img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>
                            <div class="slidedown-element nav-item">
                                @foreach($subcategories as $subcategory)
                                    @foreach($subcategory->menu->take(10) as $menu)
                                        @if(!empty($menu->slug))
                                            <a class="cat-nav-link" href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $menu->slug]) }}">{{ $menu->getName() ?? '' }}
                                                <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.21967 10.7699C-0.0732233 10.463 -0.0732233 9.96554 0.21967 9.6587L4.18934 5.5L0.21967 1.3413C-0.0732232 1.03446 -0.0732232 0.536971 0.21967 0.230131C0.512563 -0.0767097 0.987437 -0.0767097 1.28033 0.230131L5.78033 4.94442C6.07322 5.25126 6.07322 5.74874 5.78033 6.05558L1.28033 10.7699C0.987437 11.0767 0.512563 11.0767 0.21967 10.7699Z" fill="#272727"/>
                                                </svg>
                                            </a>
                                        @endif
                                    @endforeach
                                    <a href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => 'yuvelirnye-izdeliya']) }}" class="watch-all">{{ __('Смотреть все') }}</a>
                                @endforeach
                            </div>

                    </div>
                    <div class="menu-list">
                        {{--Clothes--}}
                        @php
                            $category = $categories->where('code', 2)->first();
                            $subcategories = $subCategories->whereIn('id', [3, 8, 9, 10]);
                        @endphp
                        <p class="dropdown-list mobile-slideover title">{{ $category->getName() }} <img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>
                        @foreach($subcategories as $subcategory)
                            <div class="slidedown-element nav-item">
                                @foreach($subcategory->menu->take(10) as $menu)
                                    @if(!empty($menu->slug))
                                        <a class="cat-nav-link" href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $menu->slug]) }}">{{ $menu->getName() ?? '' }}
                                            <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M0.21967 10.7699C-0.0732233 10.463 -0.0732233 9.96554 0.21967 9.6587L4.18934 5.5L0.21967 1.3413C-0.0732232 1.03446 -0.0732232 0.536971 0.21967 0.230131C0.512563 -0.0767097 0.987437 -0.0767097 1.28033 0.230131L5.78033 4.94442C6.07322 5.25126 6.07322 5.74874 5.78033 6.05558L1.28033 10.7699C0.987437 11.0767 0.512563 11.0767 0.21967 10.7699Z" fill="#272727"/>
                                            </svg>
                                        </a>
                                    @endif
                                @endforeach
                                <a href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $category->slug]) }}" class="watch-all">{{ __('Смотреть все') }}</a>
                            </div>
                        @endforeach
                    </div>
                    <div class="menu-list">
                        {{--Interior--}}
                        @php
                            $category = $categories->where('code', 1)->first();
                            $subcategories = $subCategories->whereIn('id', [6, 7]);
                        @endphp
                        <p class="dropdown-list mobile-slideover title">{{ $category->getName() }} <img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>
                        @foreach($subcategories as $subcategory)
                            <div class="slidedown-element nav-item">
                                @foreach($subcategory->menu->take(10) as $menu)
                                    @if(!empty($menu->slug))
                                        <a class="cat-nav-link" href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $menu->slug]) }}">{{ $menu->getName() ?? '' }}
                                            <svg width="6" height="11" viewBox="0 0 6 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M0.21967 10.7699C-0.0732233 10.463 -0.0732233 9.96554 0.21967 9.6587L4.18934 5.5L0.21967 1.3413C-0.0732232 1.03446 -0.0732232 0.536971 0.21967 0.230131C0.512563 -0.0767097 0.987437 -0.0767097 1.28033 0.230131L5.78033 4.94442C6.07322 5.25126 6.07322 5.74874 5.78033 6.05558L1.28033 10.7699C0.987437 11.0767 0.512563 11.0767 0.21967 10.7699Z" fill="#272727"/>
                                            </svg>
                                        </a>
                                    @endif
                                @endforeach
                                <a href="{{ route('page.catalog', ['sex' => $active->slug, 'category' => $category->slug]) }}" class="watch-all">{{ __('Смотреть все') }}</a>
                            </div>
                        @endforeach
                    </div>

                    <div class="menu-list link">
                        <p class="dropdown-list mobile-slideover title">{{ __('Бренды') }}<img src="{{ url('i/icons/plus-footer.svg') }}" alt=""></p>
                        <div class="slidedown-element nav-item">
                            <div class="cat">
                                <div class="cat-item">
                                    @foreach($brands as $brand)
                                        <a href="{{ route('page.catalog', ['sex' => Cookie::has('sex') ? Cookie::get('sex') : 'female', 'category' => $brand]) }}" class="cat-nav-link">
                                            {{ $brand }}
                                        </a>
                                    @endforeach
                                </div>
                            </div>
                        </div>
                    </div>

                    <div class="menu-list link">
                        <a href="{{ route('page.zhannas_choice') }}" class="title">{{ $rename_categoryLocaled }}</a>
                    </div>
                    <div class="menu-list link">
                        <a href="#" class="title">{{ __('Новые коллекции') }}</a>
                    </div>

                    <div class="dropdown">
                        <a class="link flex element">{{ app()->getLocale() }} | {{ $currencies[$currentCurrency] }}</a>
                        <div class="droppable">
                            <a class="close-dropdown"><img src="{{ url('i/icons/close-purple.svg') }}" alt=""></a>

                            <div class="picker language flex column items-center items-start">
                                <p class="text">{{ __('Язык на сайте') }}</p>
                                <div class="selectable flex items-center">
                                    @foreach($languages as $language)
                                        <a href="{{ route('language.change', $language) }}" class="{{ ($currentLanguage == $language) ? 'active' : '' }}">{{ mb_strtoupper($language) }}</a>
                                    @endforeach
                                </div>
                            </div>
                            <div class="picker flex column items-center items-start">
                                <p class="text">{{ __('Валюта на сайте') }}</p>
                                <div class="selectable flex items-center">
                                    @foreach($currencies as $code => $value)
                                        <a href="{{ route('currency.change', $code) }}" class="{{ $currentCurrency == $code ? 'active' : '' }}">{{ $value }}</a>
                                    @endforeach
                                </div>
                            </div>
                        </div>
                    </div>

                </div>
                <div class="menu-footer">
                    <a href="#online-boutique" class="element flex item-center menu-footer-item">
                        <svg width="11" height="11" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M19.4092 6.64013C19.4092 6.64013 19.4092 6.64013 19.4092 6.59013C18.7046 4.66635 17.4261 3.00541 15.7467 1.83199C14.0673 0.658569 12.068 0.0292969 10.0192 0.0292969C7.97047 0.0292969 5.97115 0.658569 4.29173 1.83199C2.6123 3.00541 1.33382 4.66635 0.629219 6.59013C0.629219 6.59013 0.629219 6.59013 0.629219 6.64013C-0.157656 8.81102 -0.157656 11.1892 0.629219 13.3601C0.629219 13.3601 0.629219 13.3601 0.629219 13.4101C1.33382 15.3339 2.6123 16.9948 4.29173 18.1683C5.97115 19.3417 7.97047 19.971 10.0192 19.971C12.068 19.971 14.0673 19.3417 15.7467 18.1683C17.4261 16.9948 18.7046 15.3339 19.4092 13.4101C19.4092 13.4101 19.4092 13.4101 19.4092 13.3601C20.1961 11.1892 20.1961 8.81102 19.4092 6.64013ZM2.25922 12.0001C1.91245 10.6893 1.91245 9.31091 2.25922 8.00013H4.11922C3.95925 9.32866 3.95925 10.6716 4.11922 12.0001H2.25922ZM3.07922 14.0001H4.47922C4.71394 14.892 5.04943 15.7542 5.47922 16.5701C4.49852 15.9021 3.67872 15.0242 3.07922 14.0001ZM4.47922 6.00013H3.07922C3.67009 4.97921 4.47941 4.10159 5.44922 3.43013C5.02977 4.24737 4.70436 5.10954 4.47922 6.00013ZM8.99922 17.7001C7.77098 16.7988 6.90837 15.4854 6.56922 14.0001H8.99922V17.7001ZM8.99922 12.0001H6.13922C5.95261 10.6733 5.95261 9.32693 6.13922 8.00013H8.99922V12.0001ZM8.99922 6.00013H6.56922C6.90837 4.51489 7.77098 3.20144 8.99922 2.30013V6.00013ZM16.9192 6.00013H15.5192C15.2845 5.10828 14.949 4.24606 14.5192 3.43013C15.4999 4.0982 16.3197 4.97607 16.9192 6.00013ZM10.9992 2.30013C12.2275 3.20144 13.0901 4.51489 13.4292 6.00013H10.9992V2.30013ZM10.9992 17.7001V14.0001H13.4292C13.0901 15.4854 12.2275 16.7988 10.9992 17.7001ZM13.8592 12.0001H10.9992V8.00013H13.8592C14.0458 9.32693 14.0458 10.6733 13.8592 12.0001ZM14.5492 16.5701C14.979 15.7542 15.3145 14.892 15.5492 14.0001H16.9492C16.3497 15.0242 15.5299 15.9021 14.5492 16.5701ZM17.7392 12.0001H15.8792C15.9605 11.3366 16.0006 10.6686 15.9992 10.0001C16.0003 9.33163 15.9602 8.6637 15.8792 8.00013H17.7392C18.086 9.31091 18.086 10.6893 17.7392 12.0001Z" fill="black"/>
                        </svg>
                        {{ __('Онлайн бутик') }}
                    </a>
                    <a class="menu-footer-item" href="#help">{{ __('Поддержка') }}</a>
                </div>
            </div>
        </div>
    </div>
</nav>

